// JavaScript Document
{
	// reading
	"ki" : [
						{
								"sub" : "Key Ideas and Details"
								"text" : "Read closely to determine what the text says explicitly and to make logical inferences from it; cite specific textual evidence when writing or speaking to support conclusions drawn from text.",
								"det": ["Pre-read, skimming the text features (e.g., introductions, headings and sub-headings, illustrations, graphics, symbols, lists, definitions of key terms).",
											"Read actively, annotating the text for main ideas and key details; mark places that spark confusion, questions, or wonder.", 
												"Read closely, transacting with the text by connecting it to other texts, to themselves, to other readers, and to the world beyond the text.",
													"Reread, composing visual and verbal representations of their understanding, using a variety of graphic and note-taking techniques and organizers.",
														"Comprehend complex quantitative or technical information by translating between visual, mathematical and textual modes (e.g., create tables from text, written summaries from charts).",
															"Methodically read and follow complex procedures and directions precisely when carrying out experiments, taking measurements, or performing technical tasks."],
								"det1112" : null,
								"pro" : ""
						}, {
								"sub" : "Key Ideas and Details"
								"text" : "2. Determine central ideas or themes of a text and analyze their development; summarize the key supporting details and ideas.",
								"det": ["Determine how the central ideas, themes, events, or conclusions emerge and are shaped and refined by specific details in the text.",
											"Summarize central ideas and key events accurately and objectively.",
												"Paraphrase significant passages and complex information, quoting minimally or not at all."],
								"det1112" : ["Analyze how two or more central ideas interact and build on one another to provide a complex analysis."],
								"pro" : ""
						}, {
								"sub" : "Key Ideas and Details"
								"text" : "3. Analyze how and why individuals, events, and ideas develop and interact over the course of a text.",
								"det": ["Analyze in detail a series of ideas or events, including the order in they occur, how they develop, and how they are connected.",
											"Analyze how complex characters develop, interact with others, advance the plot, or contribute to the theme",
												"Determine whether earlier events caused later events or merely preceded them. Distinguish correlation from causation."],
								"det1112" : ["Analyze the impact of the author's choices (e.g., where the story is set, how the action is sequenced, characterization) on the development of the story.",
												"Evaluate various explanations for actions or events, determining which explanation is best supported by textual evidence.",
													"Determine where the text leaves matters uncertain."],
								"pro" : ""
						}
					],
	"cs" : [
					{
							"sub" : "Craft and Structure"
							"text" : "4. Interpret words and phrases as they are used in a text, including technical, connotative, and figurative meanings; analyze how specific word choices shape meaning and tone.",
							"det": ["Determine the meaning and connotations of domain-specific words, phrases, figures of speech, and symbols as they are used in context.",
										"Analyze the impact of language on meaning and tone."],
							"det1112" : ["Analyze how an author uses and refines the meaning of key terms over the course of the text."],
							"pro" : ""
					}, {
							"sub" : "Craft and Structure"
							"text" : "5. Analyze the structure of texts, including how specific sentences, paragraphs, and larger portions of the text relate to each other and the whole.",
							"det": ["Analyze in detail how the ideas and concepts in a text are developed, refined, emphasized, or connected by particular sentences, paragraphs, or sections of a text (e.g., a section, chapter, scene, stanza, image, graphic, or audio-video link).",
										"Analyze an author's choices concerning how to structure a text (plot, pacing, flashbacks, etc.) to create such effects as mystery, tension, or surprise.",
											"Integrate information from the parts of a text (e.g., images with captions, graphics with symbols or words, maps, pull-quotes) in print or digital texts. "],
							"det1112" : ["Analyze how an author uses structure (e.g., an introduction, conclusion, or resolution) to contribute to the overall meaning and aesthetic impact.",
											"Analyze and evaluate the effectiveness of the structure of an exposition or argument, and whether the structure makes points clear, convincing, and engaging.",
												"Analyze and demonstrate understanding of how the text structures information or ideas into categories or hierarchies."],
							"pro" : ""
					}, {
							"sub" : "Craft and Structure"
							"text" : "6. Assess how point of view or purpose shapes the content and style of a text.",
							"det": ["Determine an author's point of view or purpose by defining the question the author seeks to address or the problem the author seeks to understand and/or resolve.",
										"Analyze how the author uses rhetoric to advance point of view or purpose.",
											"Read texts written by authors from multiple races, ethnicities, religions, ages, cultures, sexual orientations and gender identities",
												"Analyze how an author's identity informs and shapes the content"],
							"det1112" : ["Analyze a case in which grasping point of view requires distinguishing what is directly stated in a text from what is meant (e.g., satire, irony, sarcasm, understatement).",
											"Determine the extent to which the point of view or purpose of a text can limit or distort the content and style with false assumptions, biases, and omissions."],
							"pro" : ""
					}
				],
	"ik" : [
						{
								"sub" : "Integration of Knowledge and Ideas"
								"text" : "7. Integrate and evaluate content presented in diverse media and formats, including visually and quantitatively, as well as in words.",
								"det": ["Compare and contrast the representation of a subject in 2+ different media, determining what is emphasized, modified, or omitted in each.",
											"Gather relevant content from a variety of texts."],
								"det1112" : ["Analyze, interpret, and evaluate multiple modes of a single work.",
												"Integrate multiple sources of information conveyed in diverse formats and media, including images, audio-visuals, symbols, numbers, and words, to address a question or solve a problem."],
								"pro" : ""
						}, {
							
								"sub" : "Integration of Knowledge and Ideas"
								"text" : "8. Delineate and evaluate the argument and specific claims in a text, including the validity of the reasoning and the relevance and sufficiency of the evidence. ",
								"det": ["Relate fiction, poetry, or drama to the ideas of its time.",
											"Assess the extent to which the reasoning and evidence support the author's claim or proposed solution to a problem.,"
												"Identify false statements and fallacious reasoning."],
								"det1112" : ["Analyze text through critical lenses (e.g., literary, psychological, historical, sociological, feminist).", 
												"Evaluate the hypotheses, data, analysis, and conclusions in a text, verifying information when possible and corroborating or challenging conclusions. "],
								"pro" : ""
						}, {
							
								"sub" : "Integration of Knowledge and Ideas"
								"text" : "9. Analyze how two or more texts address similar themes or topics in order to build knowledge or to compare the approaches the authors take.",
								"det": ["Analyze how an author draws on and transforms source material.", 
											"Compare and contrast treatments of the same topic in primary and secondary sources.",
												"Compare and contrast findings in multiple sources, noting when findings support or contradict previous accounts.",
													"Compare the point of view of 2+ authors on the same or similar topics, noting which details they include, emphasize, and omit.",
														"Evaluate differing claims on the same event or issue in multiple texts by assessing the authors' reasoning, and evidence."],
								"det1112" : null,
								"pro" : ""
						}
					],
	"rr" : [
						{
								"sub" : "Range of Reading and Level of Text Complexity"
								"text" : "10. Read and comprehend a range of complex literary and informational texts independently and proficiently.",
								"det": ["Synthesize information from a range of complex texts into a coherent understanding of a theme, event, idea, process, phenomenon, or concept, noting discrepancies and resolving conflicting information when possible.",
											"Select appropriate texts by considering topic, relevance to academic projects, and personal interests, applying knowledge of their reading level to the selection of books when appropriate.",
												"Read self-selected books for enjoyment frequently (5-7 days a week, at least 20 minutes a day) in and out of school.",
													"Transfer knowledge learned from a range of texts to new situations and contexts."],
								"det1112" : null,
								"pro" : ""
						}
					],
	// writing										
	"tt" : [
						{
								"sub" : "Text Types and Purposes"
								"text" : "1. Write arguments to support claims in an analysis of substantive topics or texts, using valid reasoning and relevant and sufficient evidence.",
								"det": ["Introduce precise claims on discipline-specific content, distinguishing claims from alternate or opposing claims.",
											"Anticipate the audience's knowledge level and concerns.",
												"Organize clear relationships among the claims, counterclaims, reasons, and evidence.",
													"Distinguish valid logic, reasoning, evidence, and data from that which is flawed; explain the flaws.",
														"Establish appropriate connections between the content and the writer's experiences and point of view.",
															"Develop valid counterclaims, supplying and evaluating supporting evidence.", 
																"Establish and maintain a formal style and appropriate tone that conforms to the norms of the discipline.",
																	"Provide a conclusion that follows from and supports the argument."],
								"det1112" : ["Establish the significance of the claims.",
												"Anticipate the audience's values and possible biases.",
													"Effectively organize and sequences claims, counterclaims, reasons, and evidence."],
								"pro" : ""
						}, {
							
								"sub" : "Text Types and Purposes"
								"text" : "2. Write informative/explanatory texts to examine and convey complex ideas and information clearly and accurately through effective selection, organization, and analysis of content.",
								"det": ["Introduce a topic; organize complex ideas, concepts, and information to make important connections and distinctions.",
											"Develop the topic with well-chosen, relevant and sufficient facts, data, definitions, concrete details, quotations, information and examples appropriate to the audience's knowledge.",
												"Establish appropriate connections between the content and the writer's point of view.",
													"Use precise language and domain-specific vocabulary.",
														"Establish and maintain a formal style and objective tone that conforms to the norms of the discipline.",
															"Provide a conclusion that follows from and supports the information."],
								"det1112" : ["Establish the significance of the topic",
												"Anticipate the audience's values and possible biases.",
													"Effectively sequence information so that each new element builds on that which precedes it to create a unified whole.",
														"Use techniques such as metaphor, simile, and analogy to manage the complexity of the topic."],
								"pro" : ""
						}, {
							
								"sub" : "Text Types and Purposes"
								"text" : "3. Write narratives to develop real or imagined experiences or events using effective technique, well-chosen details, and well-structured event sequences.",
								"det": ["Introduce a problem, situation, or observation, establishing conflicts and characters that engage and orient the reader",
											"Establish one or more narrators and/or points of view.",
												"Create an intentional progression of experiences or events.",
													"Use a variety of narrative techniques to develop experiences, events, and/or characters.",
														"Use precise, descriptive words and phrases, details, and sensory language.",
															"Demonstrate understanding of perspective by writing narratives, poems, essays, speeches, or reflections from one's own or a particular character's point of view.",
																"Support and clarify arguments and informative texts by incorporating narrative elements effectively.",
																	"Provide a conclusion that follows from and reflects on the content of the narrative."],
								"det1112" : ["Establish the significance of the problem, situation, or observation.",
												"Build toward a particular tone and outcome (e.g., suspense, growth, resolution).",
													"Demonstrate understanding of theme by responding to universal themes."],
								"pro" : ""
						}
					],
	"pd" : [
					{
							"sub" : "Production and Distribution of Writing"
							"text" : "4. Produce clear and coherent writing in which the development, organization, and style are appropriate to task, purpose, and audience.",
							"det": ["Gain understanding of complex topics and tasks by engaging in a variety of pre-writing routines including annotation, outlines, notes, summaries, paraphrases, graphic organizers, diagrams, labels, content-related lists, forms, cloze passages, sentence starters, etc.",
										"Determine the task and purpose by decoding the writing prompt.",
											"Refine the purpose of their writing from the general (to argue, to explain, to narrate) to the specific (e.g., to recommend, to inspire, to understand, to question).",
												"Anticipate the demographics (age, education level, gender, race, ethnicity, etc.), values, and potential biases of the intended audience.",
													"Use words, phrases, punctuation, and clauses to link sections, create transitions, and clarify relationships among ideas.",
														"Correspond effectively and appropriately for social purposes (e.g., writing a cover letter for a job application, Tweets, texts, letters and postcards, instructions for a person who will not be in their presence when it is read).",
															"Employ language conventions guided by the RHS Planning Guide for Language standards 1-3."],
							"det1112" : null,
							"pro" : ""
					}, {
						
							"sub" : "Production and Distribution of Writing"
							"text" : "5. Develop and strengthen writing as needed by planning, revising, editing, rewriting, or trying a new approach.",
							"det": ["Engage in a variety of pre-writing strategies; draft a preliminary outline."
										"Address what is most significant for a specific task, purpose and audience.",
											"Strengthen a first draft by trying a new approach (e.g., rewrite introductions; switch the point of view; add dialogue; add descriptive details, graphics, or data; modify the tone, etc.).",
												"Self-edit and peer-edit drafts; give and receive feedback guided by criteria such as the assignment-specific rubric and/or this document.",
													"Learn from the writing of others by reading and critiquing models of excellence.",
														"Edit for language conventions guided by the RHS Planning Guide for Language, standards 1-3."],
							"det1112" : null,
							"pro" : ""
					}, {
						
							"sub" : "Production and Distribution of Writing"
							"text" : "6. Use technology, including the Internet, to produce and publish writing and to interact and collaborate with others.",
							"det": ["Display information clearly, flexibly, and dynamically. Include formatting, graphics, symbols, and multimedia when useful to the reader's comprehension.",
											"Link to other information.",
												"Edit and update individual or shared writing.",
													"Collaborate online (e.g., Google Docs), giving and receiving feedback, including new arguments or information."],
							"det1112" : null,
							"pro" : ""
					}
				],
	"rb" : [
						{
								"sub" : "Research to Build and Present Knowledge"
								"text" : "7. Conduct short as well as more sustained research projects based on focused questions, demonstrating understanding of the subject under investigation.",
								"det": ["Analyze questions (e.g., comprehension questions, interpretation questions, extension questions) and formulate self-generated questions.",
											"Narrow or broaden inquiry appropriately.",
												"Synthesize multiple sources, demonstrating understanding of the subject under investigation"],
								"det1112" : null,
								"pro" : ""
						}, {
							
								"sub" : "Research to Build and Present Knowledge"
								"text" : "8. Gather relevant information from multiple print and digital sources, assess the credibility and accuracy of each source, and integrate the information while avoiding plagiarism.",
								"det": ["Use advanced searches effectively.",
											"Consider multiple types of sources: primary and secondary, scientific and literary, etc.",
												"Assess the usefulness of each source in answering the question.",
													"Synthesize information – quotes, paraphrases, summaries, images, data, etc. – selectively to maintain the flow of ideas.",
														"Paraphrase and summarize sources effectively; quote minimally.",
															"Avoid overreliance on a single source by drawing information from multiple sources.",
																"Avoid plagiarism and follow a standard citation format."],
								"det1112" : ["Assess the strengths and limitations of sources in terms of task, purpose, and audience."],
								"pro" : ""
						}, {
							
								"sub" : "Research to Build and Present Knowledge"
								"text" : "9. Draw evidence from literary or informational texts to support analysis, reflection, and research.",
								"det": ["For further guidance on drawing evidence from texts, see the RHS Planning Guide for Reading."],
								"det1112" : null,
								"pro" : ""
						}
					],
	"rw" : [
						{
								"sub" : "Range of Writing"
								"text" : "10. Write routinely over extended time frames (time for research, reflection, and revision) and shorter time frames (a single sitting or a day or two) for a range of tasks, purposes, and audiences.",
								"det": ["In addition to the types of informal and formal writing activities named in standards 1-9 above, refer to the 'Writing Is…' page at www.rhscontentliteracies.org for a wide range of formative and summative writing activities."],
								"det1112" : null,
								"pro" : ""
						}
					],	
					
	// speaking and listening
	"cc" : [
					{
							"sub" : "Comprehension and Collaboration"
							"text" : "1. Prepare to participate in collegial, civil, democratic discussions by setting rules, goals, deadlines, and roles.",
							"det": ["Come to discussions prepared, having read and researched material under study, explicitly drawing evidence from that preparation to stimulate a thoughtful, well-reasoned exchange of ideas.",
										"Work with peers to set rules for academic conversations and collegial, civil, democratic discussions, setting clear goals, deadlines, and individual roles as needed.",
											"Propel conversations by posing and responding to questions that relate the discussion to broader themes and ideas.",
												"Actively engage others into the discussion.",
													"Monitor airtime, increasing or decreasing participation accordingly.",
														"Make eye contact with the listener and audience.",
															"Respond thoughtfully to diverse perspectives; summarize points of agreement and disagreement; paraphrase another speaker's point to verify or clarify it. ",
																"Build on the ideas of others and qualify or justify their own views and understanding.",
																	"Make new connections in light of the evidence, reasoning, and ideas presented."],
							"det1112" : ["Challenge ideas and conclusion by offering alternative or opposing perspectives.",
											"Promote divergent and creative perspectives.",
												"Resolve contradictions when possible."],
							"pro" : ""
					}, {
						
							"sub" : "Comprehension and Collaboration"
							"text" : "2. Participate by posing and responding to questions, engaging others into the discussion, and evaluating comments, claims, and evidence.",
							"det": ["Explicitly draw evidence from multiple visual, quantitative, and oral sources of information presented in diverse media and formats to stimulate a thoughtful, well-reasoned exchange of ideas."
										"Evaluate the credibility, accuracy, and usefulness of sources."],
							"det1112" : ["Determine what additional information or research is required to deepen the investigation or complete the task."],
							"pro" : ""
					}, {
						
							"sub" : "Comprehension and Collaboration"
							"text" : "3. Comprehend ideas and conclusions by paraphrasing, summarizing, and making new connections.",
							"det": ["Analyze the speaker's or performer's background and level of expertise.",
										"Identify appeals to reason and emotion.",
											"Identify fallacious reasoning, or exaggerated or distorted evidence."],
							"det1112" : ["Analyze connections between the speaker's ideas and the word choice, points of emphasis, tone, and style."],
							"pro" : ""
					}
				],
	"pk" : [
						{
								"sub" : "Presentation of Knowledge and Ideas"
								"text" : "4. Deliver knowledge and ideas clearly, confidently, and precisely, and respond thoughtfully to questions and comments posed by the audience.",
								"det": ["Communicate meaning clearly, concisely, and logically so that listeners can follow the reasoning and the organization.",
											"Align the content to the purpose, audience, and a range of formal and informal tasks. ",
												"Avoid plagiarism."],
								"det1112" : ["Communicate meaning clearly, concisely and logically, conveying a clear and distinct perspective.",
												"Address alternative or opposing perspectives."],
								"pro" : ""
						}, {
							
								"sub" : "Presentation of Knowledge and Ideas"
								"text" : "5. Communicate content clearly and effectively, aligning content to task, purpose, and audience and incorporating media to enhance meaning and add interest.",
								"det": ["Incorporate digital media (textual, graphical, audio, visual, and interactive elements) to enhance understanding of findings, reasoning, and evidence and to add interest."],
								"det1112" : null,
								"pro" : ""
						}, {
							
								"sub" : "Presentation of Knowledge and Ideas"
								"text" : "6. Listen actively, analyzing and evaluating the content and style of a presentation, posing thoughtful questions and offering constructive feedback to the speaker or performer.",
								"det": ["Speak clearly by using appropriate pronunciation, volume, pace and tone to engage the audience.",
											"Use precise language (formal and informal) appropriate to the task, purpose, and audience."],
								"det1112" : null,
								"pro" : ""
						}
					],	
					
	// language
	"sl" : [
						{
								"sub" : "Standard Language Conventions"
								"text" : "1. Demonstrate command of the conventions of standard grammar and usage when writing or speaking.",
								"det": ["Produce complete sentences; recognize and correct inappropriate fragments and run-ons.",
											"Ensure subject-verb agreement.",
												"Recognize and correct inappropriate shifts in verb tense.",
													"Recognize and correct inappropriate shifts in verb voice (i.e., active and passive) and verb mood (i.e., indicative, imperative, and subjunctive).",
														"Place phrases and clauses within a sentence; recognize and correct misplaced and dangling modifiers.",
															"Use various types of phrases and clauses to convey specific meanings and add variety and interest to writing or presentations.",
																"Ensure pronoun-antecedent agreement; recognize and correct vague pronouns with unclear or ambiguous antecedents.",
																	"Recognize and correct inappropriate shifts in pronoun number and person.",
																		"Correctly use frequently confused words (e.g., there and their).",
																			"Recognize variations from conventional language in writing and speaking; identify and use strategies to improve expression.",
																				"Use parallel structure."],
									"det1112" : ["Recognize that standard written and spoken language conventions can change over time and can sometimes be contested.",
													"When usage is contested or complex, use the most effective convention to address the purpose, audience, and task, consulting references as needed."],
								"pro" : ""
						}, {
							
								"sub" : "Standard Language Conventions"
								"text" : "2. Demonstrate command of the conventions of standard capitalization, punctuation, and spelling when writing.",
								"det": ["Use punctuation (e.g., commas, parentheses, dashes) to separate items in a series and to set off nonrestrictive/parenthetical elements (i.e., words and phrases not essential to understanding).", 
											"Use a semicolon to link 2+ closely related independent clauses.",
												"Use a colon to introduce a list or quotation.",
													"Spell correctly, using available resources when necessary, such as Spell Check or a print or online dictionary."],
								"det1112" : ["Use hyphens correctly with compound numbers (e.g., thirty-six), words joined to form adjectives (e.g., well-known), and certain prefixes (e.g., pre-Civil War, mid-September).",
									"Use alternative punctuation correctly and appropriately (e.g., M-dashes, interrobangs, ellipses)."],
								"pro" : ""
						}
					],
	"kl" : [
					{
							"sub" : "Knowledge of Language"
							"text" : "3. Apply knowledge of language to understand how language functions in different contexts, to make effective choices for meaning or style, and to comprehend more fully when reading or listening.",
							"det": ["Choose words, phrases, and punctuation to convey ideas precisely and to create an effect appropriate to the context, audience, and task.",
										"Vary sentence patterns for meaning, reader/listener interest, and style.",
											"Maintain consistency in style and tone.",
												"Recognize and eliminate wordiness and redundancy.",
													"Write and edit work to conform to guidelines in a style manual appropriate for the discipline and writing type."],
							"det1112" : ["Vary syntax for effect, consulting references as needed.",
											"Apply an understanding of syntax to the study of complex texts when reading."],
							"pro" : ""
					}
				],
	"va" : [
						{
								"sub" : "Vocabulary Acquistion and Use"
								"text" : "4. Determine or clarify the meaning of unknown and multiple-meaning words and phrases (based on grade-appropriate reading and content) by using context clues, analyzing meaningful word parts, and consulting general and specialized reference materials, as appropriate.",
								"det": ["Apply knowledge of word parts (i.e., roots, prefixes, suffixes) to decode complex vocabulary.",
											"Identify and correctly use patterns of word change (e.g., analyze, analysis, analytical) that indicate different meanings or parts of speech.",
												"Consult dictionaries, glossaries, thesauruses, etc., both print and digital, to learn or verify the pronunciation, precise meanings, part of speech, and/or etymology of a word."],
								"det1112" : null,
								"pro" : ""
						}, {
							
								"sub" : "Vocabulary Acquistion and Use"
								"text" : "5. Demonstrate understanding of figurative language, word relationships, and nuances in word meanings.",
								"det": ["Identify and interpret figures of speech (e.g., euphemism, oxymoron, hyperbole, paradox) in context and analyze their role in the text.",
											"Analyze nuances in the meaning of words with similar denotations."],
								"det1112" : null,
								"pro" : ""
						}, {
						
							"sub" : "Vocabulary Acquistion and Use"
							"text" : "6. Acquire and use accurately a range of general academic and domain-specific words and phrases sufficient for reading, writing, speaking, and listening at the college and career readiness level; demonstrate independence in gathering vocabulary knowledge when encountering an unknown term important to comprehension or expression.",
							"det": ["Develop an interest and awareness in words including but not limited to assigned vocabulary lists.",
										"Acquire knowledge of the multiple meanings of high frequency, mature words (e.g., benevolent, absurd, industrious) and use them appropriately across a range of academic contexts to achieve precision and specificity.",
											"Gain fluency in the use of highly specialized, domain-specific words and phrases."],
							"det1112" : null,
							"pro" : ""
						}
					]
					
	// problem solving
	"kn" : [
					{
							"sub" : "Knowledge"
							"text" : "1. Identify and analyze a problem, challenge, or theme and generate questions and ideas.",
							"det": ["Activate prior knowledge to place the task in context.",
										"Determine the task by decoding key vocabulary and symbols.",
											"Analyze all parts of the task and any accompanying information.",
												"Consider analogous problems, challenges, or themes, trying special cases and simpler forms of the original problem to gain insight to its solution.",
													"Develop an initial question, prediction, conjecture, proposal, hypothesis, claim, or prototype."],
							"det1112" : ["Brainstorm, free-write, experiment, practice, and persist in acquiring design or discipline-specific knowledge and skills.", 
											"Analyze all parts of the task, making conjectures about its form and meaning and applying conceptual understanding of the ideas, principles, and theories of the subject under investigation."],
							"pro" : ""
					}, {
						
							"sub" : "Knowledge"
							"text" : "2. Break down the problem, challenge, or theme into a sequence of steps, events, or parts.",
							"det": ["Identify, plan, and assign specialized procedures or instructions to address each step, event, or part.",
										"Seek multiple approaches to the task.", 
											"Plan a solution pathway rather than a series of random solution attempts."],
							"det1112" : ["Understand the approaches of others to solving similar complex problems and identify correspondences between the different approaches.",
											"Seek multiple approaches to the task, choosing from or breaking established conventions."],
							"pro" : ""
					}, {
						
							"sub" : "Knowledge"
							"text" : "3. Gather, organize, and utilize feedback, information, materials, and instruments.",
							"det": ["Determine additional materials, instruments, and/or relevant and credible information conveyed in a variety of media and formats to address the task.",
										"Prepare resources, materials, and instruments; demonstrate safe and skillful handling.", 
											"Follow multi-step procedures or instructions with precision.",
												"Monitor progress by taking notes, photographs, and/or audio recordings.",
													"Engage in self-reflection."],
							"det1112" : ["Assess the credibility, accuracy, reliability, and possible bias of sources, information, and materials."],
							"pro" : ""
					}
				],
	"pr" : [
						{
								"sub" : "Process"
								"text" : "4. Analyze information.",
								"det": ["Identify patterns in the information or create patterns based on the information.",
											"Select evidence from the patterns that informs the question, hypothesis, prediction, claim, or theme.", 
												"Evaluate evidence and reasoning from multiple perspectives.",
													"Apply modes of reasoning to the evidence.",
														"Document the process by taking notes, photographs, and/or audio recordings."],
								"det1112" : ["Apply modes of reasoning to the evidence, avoiding oversimplifications and demonstrating awareness of logical fallacies.",
												"Analyze givens, constraints, assumptions, relationships, and goals.",
													"Evaluate claims, evidence, and reasoning against currently accepted explanations.",
														"Monitor and evaluate progress, changing course if necessary."],
								"pro" : ""
						}, {
							
								"sub" : "Process"
								"text" : "5. Identify and overcome obstacles.",
								"det": ["Collaborate and exchange feedback with others.",
											"Evaluate and consider feedback in order to revise work, apply new approaches, and overcome challenges.",
												"Constructively critique the reasoning of others and seek others to critique their own reasoning.",
													"Persevere; appreciate the importance of resilience."],
								"det1112" : ["Demonstrate a variety of methods for problem solving and apply innovative approaches to overcome unanticipated challenges."],
								"pro" : ""
						}, {
							
								"sub" : "Process"
								"text" : "6. Use results to formulate a solution or to reach a conclusion.",
								"det": ["Use results to support, refute, or qualify the hypotheses, predictions, or claims.",
											"Apply relevant ideas from traditional and contemporary contexts to strengthen solutions/conclusions as needed by planning, revising, editing, or trying a new approach."],
								"det1112" : ["Strengthen results/solutions as needed by planning, revising, editing, or trying a new approach.",
												"Apply and align relevant ideas from traditional and contemporary contexts with personal vision to reflect on, re-engage, revise, and refine solutions/conclusions."],
								"pro" : ""
						},	
					],	
	"co" : [
						{
								"sub" : "Communication"
								"text" : "7. Produce and publish results using technology and materials appropriate to the task, purpose, and audience.",
								"det": ["Effectively utilize and adapt tools, processes, and media appropriate to the task and purpose for expressive intent.",
											"Anticipate the demographics (age, education level, gender, race, ethnicity, etc.), values, and potential biases of the intended audience.",
												"Analyze, select, and arrange information and artifacts for presentation.",
													"Integrate information while avoiding plagiarism.",
														"Communicate the process of developing ideas from early stages to fully elaborated ideas."],
								"det1112" : ["Demonstrate innovation in utilizing and adapting tools, styles, techniques, and processes for expressive intent.",
												"Demonstrate awareness of the task's purpose and intended audience by justifying choices in the analysis, selection, and arrangement of artifacts for presentation."],
								"pro" : ""
						}, {
							
								"sub" : "Communication"
								"text" : "8. Present work that demonstrates understanding, craftsmanship, originality, and individual responsibility.",
								"det": ["Present work that demonstrates understanding, craftsmanship, originality, and individual responsibility.",
											"Organize materials, information, evidence, and reasoning to address all parts of the task.",
												"Accurately communicate and justify knowledge, results, and conclusions to others.",
													"Place results / conclusions / solutions in their larger context.",
														"Demonstrate awareness of the ethical implications of their work; show sensitivity to their intended audience; balance creative expression (e.",g.",, texts, images, artifacts, materials, tools, equipment) with creative responsibility.", 
															"Address clarifying questions.",
																"Recognize limitations that need to be improved."],
								"det1112" : ["Communicate and justify knowledge, results, and conclusions, using logical structures in discussions with others.", 
												"Effectively explain how problems, ideas, or themes are tested or resolved.",
													"Evaluate the ethical implications of the work of others.", 
														"Address clarifying questions; determine questions that remain to be answered.",
															"Acknowledge where current data, information, materials, and / or sources leave matters uncertain."],
								"pro" : ""
						}
					],

	// responsibility	
	"cr" : [
					{
							"sub" : "Civic Responsibility"
							"text" : "1. Take an active role in the school's democratic process; prepare for the role of self-governing citizen of the United States of America.",
							"det": [""],
							"det1112" : [""],
							"pro" : ""
					}	
				],
	"sr" : [
						{
								"sub" : "Social Responsibility"
								"text" : "2. Collaborate with others and contribute to the construction of shared meaning, solutions, and conclusions.",
								"det": [""],
								"det1112" : [""],
								"pro" : ""
						}, {
							
								"sub" : "Social Responsibility"
								"text" : "3. Lead and exert a positive social influence on others.",
								"det": [""],
								"det1112" : [""],
								"pro" : ""
						}, {
							
								"sub" : "Social Responsibility"
								"text" : "4. Demonstrate respect for diverse perspectives.",
								"det": [""],
								"det1112" : [""],
								"pro" : ""
						},	
					],	
	"ir" : [
						{
								"sub" : "Individual Responsibility"
								"text" : "5. Prepare for learning in school.",
								"det": [""],
								"det1112" : [""],
								"pro" : ""
						}, {
							
								"sub" : "Individual Responsibility"
								"text" : "6. Manage time productively.",
								"det": [""],
								"det1112" : [""],
								"pro" : ""
						},	{
							
								"sub" : "Individual Responsibility"
								"text" : "7. Take ownership of learning, setting worthwhile goals and working purposefully to achieve them.",
								"det": [""],
								"det1112" : [""],
								"pro" : ""
						}
					],			
}